БухЭксп/InformationRegisters/CW_ФормулыРасчетаНормРасходаТопливаТранспортныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ФормулыРасчетаНормРасходаТопливаТранспортныхСредств</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФормулаРасчетаНормыРасходаТоплива</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ФормулыРасчетаНормыРасходаТоплива</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПараметрыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПараметрыТС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрТранпортногоСредства</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПоказателиРасчетаРасходаТоплива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПоказателиРасчетаРасходаТоплива</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УказываетсяВНастройках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСлужебный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БуквенныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_УчетСобственногоТранспортаСервер/Ext/Module.bsl
#Область ПОДГОТОВКА_НАБОРОВ_ДОКУМЕНТА_К_ПРОВЕДЕНИЮ

//подгтовка регистров документа к записи данных
Процедура ПодготовитьДвженияКПроведению(Объект) Экспорт
	
	Для Каждого НаборЗаписей Из Объект.Движения Цикл
		
		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;
		
	КонецЦикла;
	
	МассивИменРегистров = ПолучитьИспользуемыеРегистры(Объект);
	Для Каждого ИмяРегистра Из МассивИменРегистров Цикл
		Объект.Движения[ИмяРегистра].Записывать = Истина;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти


#Область ВСПОМОГАТЕЛЬНЫЕ_ТАБЛИЦЫ

Функция ПолучитьИспользуемыеРегистры(Объект) Экспорт
	
	МассивИменРегистров = Новый Массив;
	
	Для Каждого движение из  Объект.Метаданные().Движения Цикл
		МассивИменРегистров.Добавить(движение.Имя);
	КонецЦикла;

	Возврат МассивИменРегистров;
	   
КонецФункции

// 	Возвращают таблицы значений для соответсвующего регитстра
// 
Функция ПодготовитьТаблицыДанныхДляПроведения(МассивИменРегистров) Экспорт
	
	мДобавляемыеСтандарнтыеРеквизты = Новый Массив;
	мДобавляемыеСтандарнтыеРеквизты.Добавить("Период");	
	мДобавляемыеСтандарнтыеРеквизты.Добавить("ВидДвижения");	

	СтркутраДанныхДляПроведения = новый Структура;
	
	Для каждого  ИмяРегистра из МассивИменРегистров Цикл
		
		мдРегистр = ПолучитьОбъектМетаданных(ИмяРегистра);

		Если мдРегистр = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаДанных = новый ТаблицаЗначений;
		
		Для каждого СтандартныйРеквизит из мдРегистр.СтандартныеРеквизиты Цикл
			Если мДобавляемыеСтандарнтыеРеквизты.Найти(СтандартныйРеквизит.Имя) <> Неопределено Тогда
				ТаблицаДанных.Колонки.Добавить(СтандартныйРеквизит.Имя, СтандартныйРеквизит.Тип);
			КонецЕсли;
		КонецЦикла;
		
		Для каждого Измерение из мдРегистр.Измерения Цикл
			ТаблицаДанных.Колонки.Добавить(Измерение.Имя, Измерение.Тип);
		КонецЦикла;
		
		Для каждого Ресурс из мдРегистр.Ресурсы Цикл
			ТаблицаДанных.Колонки.Добавить(Ресурс.Имя, Ресурс.Тип);
		КонецЦикла;
		
		Для каждого Реквизит из мдРегистр.Реквизиты Цикл
			ТаблицаДанных.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);
		КонецЦикла;
		
		СтркутраДанныхДляПроведения.Вставить(ИмяРегистра, ТаблицаДанных);
		
	КонецЦикла;
	
	Возврат СтркутраДанныхДляПроведения;
	
КонецФункции

Функция ПолучитьОбъектМетаданных(ИмяРегистра)
	
	мдРегистра = Метаданные.РегистрыНакопления.Найти(ИмяРегистра);
	
	Если мдРегистра = Неопределено Тогда
		мдРегистра = Метаданные.РегистрыСведений.Найти(ИмяРегистра);
	КонецЕсли;
	
	Возврат мдРегистра;
	
КонецФункции

Функция ПолучитьУстанавливаемыеПараметры() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_ПараметрытранспортныхСредств.ИмяПредопределенныхДанных КАК Имя,
		|	CW_ПараметрытранспортныхСредств.Ссылка КАК ПараметрСсылка
		|ИЗ
		|	ПланВидовХарактеристик.CW_ПараметрыТранспортныхСредств КАК CW_ПараметрытранспортныхСредств
		|ГДЕ
		|	CW_ПараметрытранспортныхСредств.Ссылка <> &РегистрационныйЗнак";
	
	Запрос.УстановитьПараметр("РегистрационныйЗнак", ПланыВидовХарактеристик.CW_ПараметрыТранспортныхСредств.РегистрационныйЗнак);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураПараметров = Новый Структура;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураПараметров.Вставить(ВыборкаДетальныеЗаписи.Имя, ВыборкаДетальныеЗаписи.ПараметрСсылка);
	КонецЦикла;
	
	Возврат СтруктураПараметров;
	
КонецФункции

#КонецОбласти


#Область ЗАПИСЬ_ДВИЖЕНИЙ_ДОКУМЕНТОВ

//Процедура ЗарегистрироватьДвиженияДокумента
//
// Записывает движения документов по уччету совбсвенного транспорта
//
//Параметры:
// 		ОбъектДвижения 			- Движения документа
// 		ДанныеДляПроведения 	- Структура с таблицами значений см. вспомогательные таблицы, ключ структуры должен соответствовать имени записываемого регистра
// 		мСписокИменРегистров 	- Массив имен записываемых регистров;
//
Процедура ЗарегистрироватьДвиженияДокумента(ОбъектДвижения, ДанныеДляПроведения, мСписокИменРегистров) Экспорт
	
	Для Каждого ИмяРегистра Из мСписокИменРегистров Цикл
		
		Если ДанныеДляПроведения.Свойство(ИмяРегистра)  Тогда
			
			ТаблицаДвижений = ДанныеДляПроведения[ИмяРегистра];
			
			Если ТипЗнч(ТаблицаДвижений) = Тип("ТаблицаЗначений") Тогда
				
				Движения = ОбъектДвижения[ИмяРегистра];
				Движения.Загрузить(ТаблицаДвижений);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область РАСЧЕТ_НОРМ_РАСХОДА_ТОПЛИВА

Функция ПолучитьДействующуюФормулуНормрасходатранспортныхСредств(ДатаСреза, ТранспортноеСредство) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CW_ФормулыРасчетанормРасходаТопливаТранспортныхСредствСрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
		|	CW_ФормулыРасчетанормРасходаТопливаТранспортныхСредствСрезПоследних.ФормулаРасчетаНормыРасходаТоплива КАК ФормулаРасчетаНормыРасходаТоплива,
		|	CW_ФормулыРасчетанормРасходаТопливаТранспортныхСредствСрезПоследних.ДействуетДо КАК ДействуетДо
		|ИЗ
		|	РегистрСведений.CW_ФормулыРасчетаНормРасходаТопливаТранспортныхСредств.СрезПоследних(&ДатаСреза, ТранспортноеСредство = &ТранспортноеСредство) КАК CW_ФормулыРасчетанормРасходаТопливаТранспортныхСредствСрезПоследних
		|ГДЕ
		|	CW_ФормулыРасчетанормРасходаТопливаТранспортныхСредствСрезПоследних.ТранспортноеСредство = &ТранспортноеСредство";
	
	Запрос.УстановитьПараметр("ДатаСреза"			, ДатаСреза);
	Запрос.УстановитьПараметр("ТранспортноеСредство", ТранспортноеСредство);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ПараметрыФормулы = Новый Структура("ДействуетДо,ФормулаРасчетаНормыРасходаТоплива");
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		
		Если не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ФормулаРасчетаНормыРасходаТоплива) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.ДействуетДо < ДатаСреза Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ПараметрыФормулы.ФормулаРасчетаНормыРасходаТоплива = ВыборкаДетальныеЗаписи.ФормулаРасчетаНормыРасходаТоплива;
		ПараметрыФормулы.ДействуетДо = ВыборкаДетальныеЗаписи.ДействуетДо;
		
	КонецЕсли;
	
	Возврат ПараметрыФормулы;
	
КонецФункции

//-------

// Функция выбирает из формулы все слова не являющиеся разделителями и функциями.
// Предполагается, что это показатели.
Функция ИдентификаторыПоказателейФормулы(Формула)
    ИдентификаторыПоказателей = Новый Массив;
	
	РазделителиФормулы = " +-/*?=<>()," + Символы.ВК + Символы.ВТаб + Символы.НПП + Символы.ПС + Символы.ПФ + Символы.Таб;
	ЗарезервированныеСлова = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("ЦЕЛ,INT,ОКР,ROUND,МАКС,MAX,МИН,MIN,И,ИЛИ,НЕ,OR,AND,NOT");
	
	Слова = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(Формула, РазделителиФормулы);
	Для Каждого Слово Из Слова Цикл
		// Это число
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СтрЗаменить(Слово, ".", "")) Тогда
			Продолжить;
		КонецЕсли;
		// Это зарезервированное слово.
		Если ЗарезервированныеСлова.Найти(ВРег(Слово)) <> Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		// Это должен быть показатель
		ИдентификаторыПоказателей.Добавить(Слово);
	КонецЦикла;
	
    Возврат ИдентификаторыПоказателей
	
КонецФункции 

Функция ПараметрыВыполненияФормулы(Формула, ПроверятьФормулу = Истина, НаименованиеФормулы="") Экспорт
	
	Отказ = Ложь;	
	
	ПараметрыВыполнения = Неопределено;
	
	Если Не ЗначениеЗаполнено(Формула) Тогда
		Если Не ПроверятьФормулу Тогда
			Возврат ПараметрыВыполнения;
		КонецЕсли;
		ТекстСообщения = НСтр("ru = 'Формула не заполнена'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат ПараметрыВыполнения;
	КонецЕсли;
	
	// Получим  из формулы идентификаторы используемых показателей.
	ИдентификаторыПоказателейФормулы = ИдентификаторыПоказателейФормулы(Формула);
	// Проверим существование показателей.
	ПоказателиФормулы = ПоказателиПоИдентификаторам(ИдентификаторыПоказателейФормулы);
	Если ПоказателиФормулы = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат ПараметрыВыполнения;
	КонецЕсли;
	
	ФормулаДляВыполнения = ФормулаДляВыполнения(Формула, ИдентификаторыПоказателейФормулы);
	
	// Проверим правильность составления формулы.
	Если ПроверятьФормулу Тогда
		ПроверитьВыполнимостьФормулы(ФормулаДляВыполнения, ИдентификаторыПоказателейФормулы, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат ПараметрыВыполнения;
	КонецЕсли;
	
	Возврат Новый Структура("НаименованиеФормулы, ФормулаДляВыполнения, ПоказателиФормулы",НаименованиеФормулы,ФормулаДляВыполнения, ПоказателиФормулы); 
	
КонецФункции

Процедура ПроверитьВыполнимостьФормулы(ФормулаДляВыполнения, ИдентификаторыПоказателей, Отказ = Ложь)
	
	// Подготовим структуру для выполнения формулы.
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	ИсходныеДанные = Новый Структура;
	Для каждого Показатель Из ИдентификаторыПоказателей Цикл
		ИсходныеДанные.Вставить(Показатель, ГСЧ.СлучайноеЧисло(1,9));
	КонецЦикла;
	
	Попытка 
		Результат = Вычислить(ФормулаДляВыполнения);
	Исключение
		ЕстьОшибка = Истина;
		ТекстСообщения = НСтр("ru = 'При проверке вычисления по формуле возникла ошибка.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецПопытки
	
КонецПроцедуры

// Функция преобразует формулу введенную пользователем в формулу для выполнения при расчете норм расхода топлива.
// К показателям прибавляется префикс.
Функция ФормулаДляВыполнения(Формула, ИдентификаторыПоказателей)
	ФормулаДляВыполнения = "";
	
	НачалоСлова = 1;
	Для Позиция = 1 По СтрДлина(Формула) Цикл
		КодСимвола = КодСимвола(Формула, Позиция);
		Если СтроковыеФункцииКлиентСервер.ЭтоРазделительСлов(КодСимвола) Тогда
			ДописатьТекущееСловоВФормулуДляВыполнения(Формула, ФормулаДляВыполнения, Позиция, НачалоСлова, ИдентификаторыПоказателей);
			ФормулаДляВыполнения = ФормулаДляВыполнения + Сред(Формула, Позиция, 1);
			НачалоСлова = Позиция + 1;
		КонецЕсли;
	КонецЦикла;
	ДописатьТекущееСловоВФормулуДляВыполнения(Формула, ФормулаДляВыполнения, Позиция, НачалоСлова, ИдентификаторыПоказателей);
	Возврат ФормулаДляВыполнения
КонецФункции

Процедура ДописатьТекущееСловоВФормулуДляВыполнения(Формула, ФормулаДляВыполнения, Позиция, НачалоСлова, ИдентификаторыПоказателей)
 	Если Позиция <> НачалоСлова Тогда
		Слово = Сред(Формула, НачалоСлова, Позиция - НачалоСлова);
		Если ИдентификаторыПоказателей.Найти(Слово) <> Неопределено Тогда
			ФормулаДляВыполнения = ФормулаДляВыполнения + "ИсходныеДанные." + Слово;
		Иначе
			ФормулаДляВыполнения = ФормулаДляВыполнения + Слово;
		КонецЕсли;
	КонецЕсли;               
КонецПроцедуры

Функция ПоказателиПоИдентификаторам(ИдентификаторыПоказателей)
	
	Отказ = Ложь;
	
	Показатели = Новый Массив;
	Для Каждого Идентификатор Из ИдентификаторыПоказателей Цикл
		// Это должен быть показатель
		Показатель = ПоказательПоИдентификатору(Идентификатор);
		Если Не ЗначениеЗаполнено(Показатель) Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось найти показатель по идентификатору %1'"), Идентификатор);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			Продолжить;
		КонецЕсли;
		Показатели.Добавить(Показатель);
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат Неопределено
	Иначе	
		Возврат Показатели
	КонецЕсли;
	
КонецФункции 

Функция ПоказательПоИдентификатору(Идентификатор, УчитыватьРегистр = Ложь) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПоказателиРасчетаНорм.Ссылка
	|ИЗ
	|	Справочник.CW_ПоказателиРасчетаРасходаТоплива КАК ПоказателиРасчетаНорм
	|ГДЕ
	|	(ПоказателиРасчетаНорм.Идентификатор = &Идентификатор
	|			ИЛИ ПоказателиРасчетаНорм.ИдентификаторСлужебный = &ИдентификаторСлужебный)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("ИдентификаторСлужебный", ВРег(Идентификатор));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ВыполнитьРасчетНормыРасходаТопливаПоФормуле(ИсходныеДанные, ПараметрыВыполненияФормулы) Экспорт
	
	Попытка 
		Возврат Вычислить(ПараметрыВыполненияФормулы.ФормулаДляВыполнения);
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удаолось вычислитьзанчение формулы.(%1)'");
		
		Если ПустаяСтрока(ПараметрыВыполненияФормулы.НаименованиеФормулы) Тогда
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "(%1)", "");
		КонецЕсли;
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПараметрыВыполненияФормулы.НаименованиеФормулы);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецПопытки;
	
	Возврат 0;

КонецФункции

Функция ПривестиФормулуКСтроке(Формула)  Экспорт
	
	Результат = "";
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(Формула);
	
	Для НомерСтроки = 1 по ТекстовыйДокумент.КоличествоСтрок() Цикл
		СтрокаТекста = ТекстовыйДокумент.ПолучитьСтроку(НомерСтроки);                
		
		ПозицияКомментария = СтрНайти(СтрокаТекста,"//",,,1);
		Если ПозицияКомментария > 0 Тогда
			СтрокаТекста = Лев(СтрокаТекста,ПозицияКомментария-1);
		КонецЕсли;
		
		Результат = Результат + СтрокаТекста;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Своства_Документов

Функция СоздатьИЗаписатьСвойствоДокумента(СтруктураДанных) Экспорт 
	
	Ответ = Новый Структура("Успешно,ОписаниеОшибки,АдресЗначения,ИмяКонстанты",Неопределено,Неопределено,Неопределено, Неопределено);
	
	ЗаполнитьЗначенияСвойств(Ответ, СтруктураДанных);
	
	НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений[СтруктураДанных.ИмяНабораСвойств];
	
	Если НаборСвойств.Пустая() Тогда
		Ответ.Успешно = ложь;
		Ответ.ОписаниеОшибки = "Неверно указано имя набора дополнительных реквизитов";
		Возврат Ответ;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		//Создаем свойство
		НовоеСвойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		
		НовоеСвойство.Наименование 				= СтруктураДанных.Наименование;  
		НовоеСвойство.Имя 						= СтруктураДанных.Имя+Строка(Строка(Новый УникальныйИдентификатор));
		НовоеСвойство.Заголовок 				= СтруктураДанных.Заголовок;  
		НовоеСвойство.ТипЗначения  				= Новый ОписаниеТипов("Булево");
		НовоеСвойство.ЭтоДополнительноеСведение = Истина;
		НовоеСвойство.Виден 					= Истина;   
		НовоеСвойство.Доступен 					= Истина;
		НовоеСвойство.НаборСвойств 				= НаборСвойств;
		НовоеСвойство.Записать();
	Исключение
		
		Ответ.Успешно = ложь;
		Ответ.ОписаниеОшибки = ОписаниеОшибки();
		
		ОтменитьТранзакцию();
		
		Возврат Ответ;
	КонецПопытки;
	
	Попытка
		//Прописываем его в набор
		НаборСвойствОбъект 		= НаборСвойств.ПолучитьОбъект();
		НоваяСтрока 			= НаборСвойствОбъект.ДополнительныеСведения.Добавить();
		НоваяСтрока.Свойство 	= НовоеСвойство.Ссылка;
		НаборСвойствОбъект.Записать();
	Исключение
		Ответ.Успешно = ложь;
		Ответ.ОписаниеОшибки = ОписаниеОшибки();
		ОтменитьТранзакцию();
		Возврат Ответ;
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
	АдресСсылки = ПоместитьВоВременноеХранилище(НовоеСвойство.Ссылка);
	
	Ответ.Успешно 			= Истина;
	Ответ.ОписаниеОшибки 	= "";
	Ответ.АдресЗначения 	= АдресСсылки;
	
	Возврат Ответ;

КонецФункции

//Функция ПолучитьПараметрТранспортногоСредства(СтруктураДанных)
// возвращает значение параметра ТС
//
// Параметры:
//  - СтруктураДанных - данные для получения параметра;
//	- Свйоства структуры: ДатаСреза,ТранспортноеСредство, ПараметрТранпортногоСредства; 
//
//ПРИМЕР ВЫЗОВА ФУНКЦИИ
// 	СтруктураДанных = Новый Структура;
//	СтруктураДанных.Вставить("ДатаСреза", );
//	СтруктураДанных.Вставить("ТранспортноеСредство", );
//	СтруктураДанных.Вставить("ПараметрТранпортногоСредства", );
//	
//	ЗначениеПараметра = CW_УчетСобственногоТранспортаСервер.ПолучитьПараметрТранспортногоСредства(СтруктураДанных);
//
Функция ПолучитьПараметрТранспортногоСредства(СтруктураДанных) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыТССрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
	               |	CW_ПараметрыТССрезПоследних.ПараметрТранпортногоСредства КАК ПараметрТранпортногоСредства,
	               |	CW_ПараметрыТССрезПоследних.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.CW_ПараметрыТС.СрезПоследних(
	               |			&ДатаСреза,
	               |			ТранспортноеСредство = &ТранспортноеСредство
	               |				И ПараметрТранпортногоСредства = &ПараметрТранпортногоСредства) КАК CW_ПараметрыТССрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза"						, СтруктураДанных.ДатаСреза);
	Запрос.УстановитьПараметр("ТранспортноеСредство"			, СтруктураДанных.ТранспортноеСредство);
	Запрос.УстановитьПараметр("ПараметрТранпортногоСредства"	, СтруктураДанных.ПараметрТранпортногоСредства);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;
	
	Возврат Неопределено;
	
	
КонецФункции


#КонецОбласти
